// ============================================================================
// Target
// ----------------------------------------------------------------------------
"Target.ESP_title" = "Installare Clover nella ESP";
"Target.ESP_description" = "Installa Clover nella ESP (EFI System Partition) nel volume di destinazione.

ESP necessita di essere formattata in Fat32.

Formattare in Fat32 nel seguente modo:
diskutil list
newfs_msdos -v EFI -F 32 /dev/rdisk9s1


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------

"Bootloader_title" = "Bootloader";
"Bootloader_description" = "Clover EFI richiede tre file essenziali. (in semplici termini)
boot0 (Sul disco MBR) responsabile del caricamento del boot1.
boot1 (Settore di avvio della partizione) per trovare il boot2.
boot2 (Nella cartella principale della partizione) per caricare /EFI/BOOT/CLOVERIA32.efi o CLOVERX64.efi, e il kernel etc.";

"boot0_title" = "BIOS MBR boot0 (HFS+Fat32)";
"boot0_description" = "Usato per l'avvio da BIOS nelle schede madri con BIOS.
Usa fdisk440 per installare il boot0 nei primi 440 bits del MBR senza alterare l'installazione Windows se possedute, quindi boot0 cercherà la prima partizione HFS attiva per boot1h2, o cercherà nella prima partizione attiva Fat32 per il boot1f32alt.
Se questo è selezionato la partizione HFS e Fat32 saranno attivate.
Bisogna formattare come Fat32 in Win o Mac nel seguente modo.
  1. Prima cancellare come MS-DOS (FAT) da Utilità Disco.
  2. diskutil list
  3. diskutil unmount /dev/rdisk9s1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  5. diskutil mount /dev/rdisk9s1";

"boot0hfs_title" = "BIOS MBR boot0hfs (HFS+Fat32)";
"boot0hfs_description" = "Usato per l'avvio da BIOS nelle schede madri con BIOS.
Usa fdisk440 per installare il boot0 nei primi 440 bits del MBR senza inibire precedenti installazioni di Windows se possedute, quindi boot0 cercherà la prima partizione HFS attiva per boot1h2, o cercherà nella prima partizione attiva Fat32 per il boot1f32alt.
Se non si seleziona questo,la partizione HFS sarà attivata, però se è selezionata la partizione Fat32 sarà questa ad essere attivata.
Bisogna formattare come Fat32 in Win o Mac nel seguente modo.
  1. Prima cancellare come MS-DOS (FAT) da Utilità Disco.
  2. diskutil list
  3. diskutil unmount /dev/rdisk9s1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  5. diskutil mount /dev/rdisk9s1";

"bootNo_title" = "Non aggiornare i settori MBR e PBR";
"bootNo_description" = "Non installa nessun bootloader (boot0X, boot1X).
Utile per schede madri con bios UEFI che non hanno bisogno dei file per il bootloader. 
Può essere usato anche se non si desidera aggiornare i settori MBR o PBR.";

"AltBoot_title" = "Usare un bootloader alternativo PBR";
"AltBoot_description" = "Consente di selezionare il file di avvio premendo un tasto.
File di avvio = boot{tasto premuto}";


"boot32_title" = "Installa e avvia prima in 32bit";
"boot32_description" = "Installa i file di avvio e configura che l'avvio sia prima a 32bit.
Avvio di base ------------ = Clover EFI 32bit. Tu puoi...
Premi il tasto 1 per boot1 = Chameleon boot,
Premi il tasto 3 per boot3 = Clover EFI 32bit boot,
Premi il tasto 6 per boot6 = Clover EFI 64bit boot.";

"boot64_title" = "Installa e avvia prima in 64bit";
"boot64_description" = "Installa i file di avvio e configura che l'avvio sia prima a 64bit.
Avvio di base ------------ = Clover EFI 64bit. Tu puoi...
Premi il tasto 1 per boot1 = Chameleon boot,
Premi il tasto 3 per boot3 = Clover EFI 32bit boot,
Premi il tasto 6 per boot6 = Clover EFI 64bit boot.";

// ============================================================================
// CloverEFI
// ----------------------------------------------------------------------------
"CloverEFI_title" = "CloverEFI";
"CloverEFI_description" = "Selezionare la versione di CloverEFI da installare.";
"cloverEFI.32_title" = "CloverEFI 32-bit";
"cloverEFI.32_description" = "CloverEFI 32-bit";
"cloverEFI.64.sata_title" = "CloverEFI 64-bit SATA";
"cloverEFI.64.sata_description" = "CloverEFI 64-bit per unità che utilizzano SATA controllers";
"cloverEFI.64.blockio_title" = "CloverEFI 64-bit BiosBlockIO";
"cloverEFI.64.blockio_description" = "CloverEFI 64-bit per unità che utilizzano RAID controllers, JMicron, NForce ed altri controllers SATA/ATA/SCSI di terze parti.";

// ============================================================================
// Themes
// ----------------------------------------------------------------------------

"Themes_title" = "Temi";
"Themes_description" = "Seleziona per installare i temi.";

"black_green_title" = "black_green";
"black_green_description" = "Tema di base black_green di Blackosx,
Installa in /EFI/CLOVER/themes/black_green.";

"AppleStyle_title" = "AppleStyle";
"AppleStyle_description" = "AppleStyle theme di Eps,
Installa in /EFI/CLOVER/themes/AppleStyle.";

"mrengles_title" = "mrengles";
"mrengles_description" = "mrengles theme di mrengles,
Installa in /EFI/CLOVER/themes/mrengles.";

"iBootloader_title" = "iClover";
"iBootloader_description" = "Grey style theme by winlog,
Installa in /EFI/CLOVER/themes/iClover.";

"buttons_title" = "buttons";
"buttons_description" = "Tema Buttons di Trauma,
Installa in /EFI/CLOVER/themes/buttons.";

"hellfire_title" = "hellfire";
"hellfire_description" = "Tema Hellfire di illevelll,
Installa in /EFI/CLOVER/themes/hellfire.";

"metal_title" = "metal";
"metal_description" = "Il tema original metal di Slice,
Installa in /EFI/CLOVER/themes/metal.";

"simple_gray_title" = "simple_gray";
"simple_gray_description" = "Tema Simple_gray di hijeane,
Installa in /EFI/CLOVER/themes/simple_gray.";

"wooden_title" = "wooden";
"wooden_description" = "Tema Wooden di iROOTa,
Installa in /EFI/CLOVER/themes/wooden.";

// ============================================================================
// RC Scripts
// ----------------------------------------------------------------------------
"rc.scripts.on.target_title" = "RC scripts sul volume di destinazione";
"rc.scripts.on.target_description" = "Installa tutti gli RC scripts sul volume di destinazione.
Il volume di destinazione deve essere un volume OSX avviabile.";
"rc.scripts.on.all.volumes_title" = "RC scripts su tutti i volumi avviabili";
"rc.scripts.on.all.volumes_description" = "Installa tutti gli RC scripts su tutti i volumi interni OSX avviabili.";
"Optional RC Scripts" = "RC Scripts Opzionali";
"disable sleep proxy client" = "Disabilita il servizio Sleep Proxy";
"disable_sleep_proxy_client_description" = "Script che disabilita il servizio BONJOUR (sleep proxy client). Eviterà che il sistema, in caso di standby, si risvegli ogni ora.";

// ----------------------------------------------------------------------------
